CRUD-general-purpose/2022/ranking_batch-0_apache-cassandra-400-vanilla-os-small-medium-ionoscloud-2022_0_SyPd4d5n/0_load.txt
/usr/java/bin/java -XX:MaxRAMPercentage=85.0 -cp /binary/ycsb/cassandra-binding/conf:/binary/ycsb/conf:/binary/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/binary/ycsb/lib/HdrHistogram-2.1.4.jar:/binary/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/binary/ycsb/lib/core-0.17.0.jar:/binary/ycsb/lib/jackson-core-asl-1.9.4.jar:/binary/ycsb/cassandra-binding/lib/netty-handler-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/guava-16.0.1.jar:/binary/ycsb/cassandra-binding/lib/cassandra-driver-core-3.0.0.jar:/binary/ycsb/cassandra-binding/lib/slf4j-api-1.7.25.jar:/binary/ycsb/cassandra-binding/lib/metrics-core-3.1.2.jar:/binary/ycsb/cassandra-binding/lib/netty-common-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/netty-buffer-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/netty-transport-4.0.33.Final.jar:/binary/ycsb/cassandra-binding/lib/cassandra-binding-0.17.0.jar:/binary/ycsb/cassandra-binding/lib/netty-codec-4.0.33.Final.jar site.ycsb.Client -db site.ycsb.db.CassandraCQLClient -s -p hosts=85.215.242.127 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
Command line: -db site.ycsb.db.CassandraCQLClient -s -p hosts=85.215.242.127 -p cassandra.keyspace=ycsb -target 25000 -p workload=site.ycsb.workloads.CoreWorkload -threads 100 -p recordcount=5000000 -p operationcount=54000000 -p fieldcount=10 -p fieldlength=50 -p requestdistribution=zipfian -p insertorder=ordered -p readproportion=0.5 -p updateproportion=0.0 -p insertproportion=0.5 -p scanproportion=0.0 -p scanlengthdistribution=uniform -p core_workload_insertion_retry_limit=3 -p core_workload_insertion_retry_interval=3 -load
YCSB Client 0.17.0

Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
2022-04-27 15:48:58:455 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2022-04-27 15:49:08:409 10 sec: 234384 operations; 23438.4 current ops/sec; est completion in 3 minutes [INSERT: Count=234425, Max=209663, Min=176, Avg=1489.76, 90=3753, 99=12279, 99.9=31359, 99.99=176639] 
2022-04-27 15:49:18:410 20 sec: 484397 operations; 25001.3 current ops/sec; est completion in 3 minutes [INSERT: Count=250008, Max=356607, Min=184, Avg=657.28, 90=712, 99=2845, 99.9=11095, 99.99=354303] 
2022-04-27 15:49:28:410 30 sec: 734398 operations; 25000.1 current ops/sec; est completion in 2 minutes [INSERT: Count=249997, Max=833535, Min=180, Avg=1066.37, 90=1236, 99=2809, 99.9=17391, 99.99=742911] 
2022-04-27 15:49:38:411 40 sec: 984388 operations; 24999 current ops/sec; est completion in 2 minutes [INSERT: Count=250018, Max=401151, Min=176, Avg=624.39, 90=564, 99=2761, 99.9=8183, 99.99=398079] 
2022-04-27 15:49:48:409 50 sec: 1234391 operations; 25000.3 current ops/sec; est completion in 2 minutes [INSERT: Count=249991, Max=424191, Min=180, Avg=669.35, 90=639, 99=3165, 99.9=7067, 99.99=420351] 
2022-04-27 15:49:58:409 60 sec: 1484388 operations; 24999.7 current ops/sec; est completion in 2 minutes [INSERT: Count=249978, Max=16655, Min=185, Avg=373.17, 90=431, 99=1359, 99.9=5247, 99.99=13791] 
2022-04-27 15:50:08:409 70 sec: 1734383 operations; 24999.5 current ops/sec; est completion in 2 minutes [INSERT: Count=249996, Max=518399, Min=187, Avg=1010.14, 90=1347, 99=3303, 99.9=153599, 99.99=515839] 
2022-04-27 15:50:18:409 80 sec: 1984381 operations; 24999.8 current ops/sec; est completion in 2 minutes [INSERT: Count=250001, Max=305407, Min=195, Avg=873.16, 90=1317, 99=3889, 99.9=170111, 99.99=249983] 
2022-04-27 15:50:28:409 90 sec: 2234386 operations; 25000.5 current ops/sec; est completion in 1 minute [INSERT: Count=250007, Max=357887, Min=181, Avg=1019.11, 90=1450, 99=3567, 99.9=185215, 99.99=355583] 
2022-04-27 15:50:38:409 100 sec: 2484392 operations; 25000.6 current ops/sec; est completion in 1 minute [INSERT: Count=250005, Max=334847, Min=179, Avg=682.89, 90=777, 99=2515, 99.9=12591, 99.99=334591] 
2022-04-27 15:50:48:409 110 sec: 2734386 operations; 24999.4 current ops/sec; est completion in 1 minute [INSERT: Count=249990, Max=447487, Min=191, Avg=853.09, 90=1159, 99=3221, 99.9=11751, 99.99=436479] 
2022-04-27 15:50:58:409 120 sec: 2984384 operations; 24999.8 current ops/sec; est completion in 1 minute [INSERT: Count=249999, Max=458751, Min=181, Avg=716.86, 90=1098, 99=3501, 99.9=12679, 99.99=456703] 
2022-04-27 15:51:08:409 130 sec: 3234387 operations; 25000.3 current ops/sec; est completion in 1 minute [INSERT: Count=250003, Max=288767, Min=183, Avg=656.07, 90=933, 99=3561, 99.9=10431, 99.99=285951] 
2022-04-27 15:51:18:409 140 sec: 3484381 operations; 24999.4 current ops/sec; est completion in 1 minute [INSERT: Count=249988, Max=226047, Min=183, Avg=766.39, 90=1258, 99=3929, 99.9=13183, 99.99=223359] 
2022-04-27 15:51:28:409 150 sec: 3734387 operations; 25000.6 current ops/sec; est completion in 51 seconds [INSERT: Count=250019, Max=303871, Min=181, Avg=810.62, 90=1248, 99=4307, 99.9=93759, 99.99=228351] 
2022-04-27 15:51:38:409 160 sec: 3984386 operations; 24999.9 current ops/sec; est completion in 41 seconds [INSERT: Count=249991, Max=353791, Min=177, Avg=682.37, 90=1080, 99=3875, 99.9=12447, 99.99=352255] 
2022-04-27 15:51:48:409 170 sec: 4234387 operations; 25000.1 current ops/sec; est completion in 31 seconds [INSERT: Count=250004, Max=559615, Min=180, Avg=903.24, 90=1468, 99=3951, 99.9=15103, 99.99=557055] 
2022-04-27 15:51:58:409 180 sec: 4484383 operations; 24999.6 current ops/sec; est completion in 21 seconds [INSERT: Count=250001, Max=400127, Min=172, Avg=691.25, 90=1013, 99=3565, 99.9=12471, 99.99=397567] 
2022-04-27 15:52:08:409 190 sec: 4734385 operations; 25000.2 current ops/sec; est completion in 11 seconds [INSERT: Count=250001, Max=320767, Min=177, Avg=633.22, 90=612, 99=3341, 99.9=11191, 99.99=319231] 
2022-04-27 15:52:18:409 200 sec: 4984387 operations; 25000.2 current ops/sec; est completion in 1 second [INSERT: Count=249994, Max=315391, Min=190, Avg=1169.18, 90=1626, 99=5203, 99.9=220031, 99.99=259455] 
2022-04-27 15:52:21:280 202 sec: 5000000 operations; 5440.07 current ops/sec; [CLEANUP: Count=100, Max=2232319, Min=0, Avg=22315.63, 90=5, 99=11, 99.9=2232319, 99.99=2232319] [INSERT: Count=15584, Max=14391, Min=215, Avg=735.09, 90=2055, 99=5079, 99.9=13527, 99.99=14207] 
[OVERALL], RunTime(ms), 202870
[OVERALL], Throughput(ops/sec), 24646.325232907773
[TOTAL_GCS_PS_Scavenge], Count, 186
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1236
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.6092571597574802
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 186
[TOTAL_GC_TIME], Time(ms), 1236
[TOTAL_GC_TIME_%], Time(%), 0.6092571597574802
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 22315.63
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2232319
[CLEANUP], 95thPercentileLatency(us), 6
[CLEANUP], 99thPercentileLatency(us), 11
[INSERT], Operations, 5000000
[INSERT], AverageLatency(us), 815.0452346
[INSERT], MinLatency(us), 172
[INSERT], MaxLatency(us), 833535
[INSERT], 95thPercentileLatency(us), 1884
[INSERT], 99thPercentileLatency(us), 4207
[INSERT], Return=OK, 5000000